#!/usr/bin/env python3
# coding=utf-8
# ----------------------------------------------------------------------------------------------------
# 类 Pool
# ----------------------------------------------------------------------------------------------------
# 变更履历：
# 2020-04-16 | Zou Mingzhe   | Ver0.1  | 初始版本
# ----------------------------------------------------------------------------------------------------
# MAP：
# 已测试 | Version(self, ...)           | 版本显示
# ----------------------------------------------------------------------------------------------------
class Pool():
    """
    Pool类提供了对池的管理。
    """
    def __init__(self):
        self.__version = "0.1"
        self.pool = []
# ----------------------------------------------------------------------------------------------------
    def Version(self, isShow = False):
        """
        版本显示：
        输入参数：isShow = False
        返回参数：self.__version
        说明：调用该方法将返回类的版本号，若isShow == True则会在屏幕上打印版本号。
        """
        if(isShow):
            print("[ztools]-[ThreadPool]-[vesion:%s]" % self.__version)
        return self.__version
# ----------------------------------------------------------------------------------------------------
    def len(self):
        """
        获取池长度：
        输入参数：
        返回参数：
        说明：调用该方法将从池中项的数量。
        """
        return len(self.pool)
# ----------------------------------------------------------------------------------------------------
    def get(self):
        """
        获取项：
        输入参数：
        返回参数：thd
        说明：调用该方法将从池中取出一个项item。
        """
        if (self.len() > 0):
            item = self.pool.pop(0)
            return item
        else:
            return None
# ----------------------------------------------------------------------------------------------------
    def put(self, item):
        """
        添加项：
        输入参数：item
        返回参数：
        说明：调用该方法将向池中添加一个项item。
        """
        self.pool.append(item)
# ----------------------------------------------------------------------------------------------------
