#!/usr/bin/env python3
# coding=utf-8
# ----------------------------------------------------------------------------------------------------
# 类 tprint
# ----------------------------------------------------------------------------------------------------
# 变更履历：
# 2020-01-06 | Zou Mingzhe   | Ver0.1  | 初始版本
# ----------------------------------------------------------------------------------------------------
# MAP：
# 已测试 | flush(self)                  | 刷出缓冲区
# ----------------------------------------------------------------------------------------------------
class tprint:
    """
    timeout类提供了计时和超时判断功能，它通过调用系统time模块来获取时间。
    """
    def __init__(self):
        self.__version = "0.1"
        self.__string = ""
# ----------------------------------------------------------------------------------------------------
    def flush(self):
        """
        刷出缓冲区：
        输入参数：无
        返回参数：无
        说明：调用该方法将刷出缓冲区。
        """
        if self.__string:
            print(self.__string)
            self.__string = ""
# ----------------------------------------------------------------------------------------------------
    def color(self, string, style = None, foreground = None, background = None):
        """
        打印信息至缓冲区：
        输入参数：style 样式 foreground 前景色 background 背景色
        返回参数：无
        说明：调用该方法将打印信息加入缓冲区。
        style : 0（默认\）、1（高亮）、22（非粗体）、4（下划线）、24（非下划线）、 5（闪烁）、25（非闪烁）、7（反显）、27（非反显）
        foreground : 30（黑色）、31（红色）、32（绿色）、 33（黄色）、34（蓝色）、35（洋红）、36（青色）、37（白色）
        background : 40（黑色）、41（红色）、42（绿色）、 43（黄色）、44（蓝色）、45（洋红）、46（青色）、47（白色）
        """
        if style or foreground or background:
            self.__string =  self.__string + "\033["
            if style:
                self.__string =  self.__string + str(style) + ";"
            if foreground:
                self.__string =  self.__string + str(foreground) + ";"
            if background:
                self.__string =  self.__string + str(background) + ";"
            self.__string =  self.__string + "m" + string + "\033[0m"
        else:
            self.__string =  self.__string + string
# ----------------------------------------------------------------------------------------------------
